In [1]:
##Essentional Functionaly
import numpy as np
import pandas as pd

In [15]:
seriesObj = pd.Series([4,6,3,7],index=['d','a','b','c'])
seriesObj

d    4
a    6
b    3
c    7
dtype: int64

In [17]:
#注意reindex函数产生的只是一个拷贝
seriesObj = seriesObj.reindex(['a','b','c','d','e'])
seriesObj

a    6.0
b    3.0
c    7.0
d    4.0
e    NaN
dtype: float64

In [28]:
seriesObj.reindex(['a','j','k'],method='ffill')

a    6.0
j    NaN
k    NaN
dtype: float64

In [31]:
Obj1 = pd.Series(['Yellow','Green','Red'],index=[0,2,4])
Obj1

0    Yellow
2     Green
4       Red
dtype: object

In [41]:
Obj2 = Obj1.reindex([0,1,2,3,4,5,7,9,10],method = 'ffill')
Obj2

0     Yellow
1     Yellow
2      Green
3      Green
4        Red
5        Red
7        Red
9        Red
10       Red
dtype: object

In [88]:
#在DataFrame中，reindex的使用
Obj3 = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','b','c'],columns=['c1','c2','c3'])
#行reindex
Obj3Re1=Obj3.reindex(['a','c','d'])
Obj3

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8

In [57]:
Obj3Re1

    c1   c2   c3
a  0.0  1.0  2.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN

In [61]:
#列reindex
Obj3Re2=Obj3.reindex(columns=['c2','c1',6])
Obj3Re2

   c2  c1   6
a   1   0 NaN
b   4   3 NaN
c   7   6 NaN

In [67]:
#使用loc进行更简单的索引(注意调用的时候是方括号!)
Obj3Re3=Obj3.loc[['a','b'],['c2','c1']]
Obj3Re3

   c2  c1
a   1   0
b   4   3

#更多详情看reindex的文档，还有method,fill_value,limit,tolerance,level,copy等函数

In [68]:
#索引中剔除每项索引
seriesObj

a    6.0
b    3.0
c    7.0
d    4.0
e    NaN
dtype: float64

In [69]:
seriesObj.drop('b')

a    6.0
c    7.0
d    4.0
e    NaN
dtype: float64

In [71]:
#Drop多项索引
seriesObj.drop(['a','d','e'])

b    3.0
c    7.0
dtype: float64

In [82]:
#DataFrame的Drop
Obj3.drop(index=['a'],columns=['c1'])
#删除某列: Obj3.drop('c2',axis='1')或者axis='columns'

   c2  c3
b   4   5
c   7   8

In [89]:
#原处更改，注意！小心！
Obj3.drop('a',inplace=True)
Obj3

   c1  c2  c3
b   3   4   5
c   6   7   8

# 索引、选择、过滤

In [101]:
#Series索引
seriesObj

a    6.0
b    3.0
c    7.0
d    4.0
e    NaN
dtype: float64

In [102]:
seriesObj['c']

7.0

In [104]:
seriesObj[0:3]

a    6.0
b    3.0
c    7.0
dtype: float64

In [105]:
seriesObj[['d','c','a']]

d    4.0
c    7.0
a    6.0
dtype: float64

In [109]:
seriesObj[[0,3]]

a    6.0
d    4.0
dtype: float64

In [112]:
#条件取值
seriesObj[seriesObj<5]

b    3.0
d    4.0
dtype: float64

In [114]:
#重新赋值
seriesObj['a','d'] = 1
seriesObj

a    1.0
b    3.0
c    7.0
d    1.0
e    NaN
dtype: float64

In [127]:
#DataFrame索引
Obj4 = pd.DataFrame(np.arange(16).reshape(4,4),index=['Asis','Africa','Euro','Austria'],columns=['a','b','c','d'])
Obj4

          a   b   c   d
Asis      0   1   2   3
Africa    4   5   6   7
Euro      8   9  10  11
Austria  12  13  14  15

In [133]:
#该方式只能按列索引，按行会出错
Obj4['c']

Asis        2
Africa      6
Euro       10
Austria    14
Name: c, dtype: int32

In [129]:
Obj4[['c','a']]

          c   a
Asis      2   0
Africa    6   4
Euro     10   8
Austria  14  12

In [139]:
#此方式按行索引
Obj4[0:2]

        a  b  c  d
Asis    0  1  2  3
Africa  4  5  6  7

In [134]:
Obj4[Obj4>5]

            a     b     c     d
Asis      NaN   NaN   NaN   NaN
Africa    NaN   NaN   6.0   7.0
Euro      8.0   9.0  10.0  11.0
Austria  12.0  13.0  14.0  15.0

In [135]:
#该方式还会存在其他列
Obj4[Obj4['c']>9]

          a   b   c   d
Euro      8   9  10  11
Austria  12  13  14  15

In [140]:
#返回布尔DataFrame
Obj4<8

             a      b      c      d
Asis      True   True   True   True
Africa    True   True   True   True
Euro     False  False  False  False
Austria  False  False  False  False

In [142]:
#令符合条件的元素为0
Obj4[Obj4<8] = 0
Obj4

          a   b   c   d
Asis      0   0   0   0
Africa    0   0   0   0
Euro      8   9  10  11
Austria  12  13  14  15

In [147]:
#使用loc索引多行多列
Obj4.loc[['Asis','Austria'],['a','b']]

          a   b
Asis      0   0
Austria  12  13

In [159]:
#也可以用整数iloc来索引!
Obj4.iloc[[1,2],[2,3]]
#和使用Obj4.iloc[[1,2],2:4]效果一致！注意使用slice不需要方括号包围!

         c   d
Africa   0   0
Euro    10  11

In [166]:
#单行索引
Obj4.iloc[2]
#使用Obj4.iloc[2,:]效果一样

a     8
b     9
c    10
d    11
Name: Euro, dtype: int32

In [168]:
#还可以使用如下方法返回bool型DataFrame
Obj4.iloc[:,0:3][Obj4>9]

            a     b     c
Asis      NaN   NaN   NaN
Africa    NaN   NaN   NaN
Euro      NaN   NaN  10.0
Austria  12.0  13.0  14.0

<img src="png/3.png" width="60%">

<img src="png/4.png" width="60%">